src/InformationRegisters/ИсторияИзмененияСтатусов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ИсторияИзмененияСтатусов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МинутПробылВИсходномСтатусе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсходныйСтатус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонечныйСтатус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗаписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИсторияИзмененияСтатусов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	Процедура ОбновитьЗаписи(Номера = Неопределено) Экспорт 
		Если Номера = Неопределено Тогда
			СписокЗадач = ВзаимодействиеC_JIRA_КлиентСервер.ПолучитьЗадачиОбновленныеСегодня(Истина);
		Иначе
			СписокЗадач = ВзаимодействиеC_JIRA_КлиентСервер.ПолучитьСписокЗадач(СтрШаблон("key in(%1)", СтрСоединить(Номера, ",")), Истина);
		КонецЕсли;
		
		Для Каждого Задача Из СписокЗадач Цикл
			Лог = Задача["changelog"];
			Если Лог = Неопределено Тогда
				Продолжить;	
			КонецЕсли;
			
			Набор = РегистрыСведений.ИсторияИзмененияСтатусов.СоздатьНаборЗаписей();
			Набор.Отбор.НомерЗадачи.Установить(Задача["key"]);
			
			Для Каждого ЗаписьЛога Из Лог["histories"] Цикл
				Для Каждого Изменение Из ЗаписьЛога["items"] Цикл
					Если НРег(Изменение["field"]) <> "status" Тогда
						Продолжить;	
					КонецЕсли;
					
					Запись = Набор.Добавить();
					Запись.НомерЗаписи = Набор.Количество();
					Запись.НомерЗадачи = Задача["key"];
					Запись.Автор = Справочники.Пользователи.НайтиСоздатьПользователя(ЗаписьЛога["author"]);
					Запись.ДатаСобытия = ВзаимодействиеC_JIRA_КлиентСервер.ПреобразоватьВДату(ЗаписьЛога["created"]);
					Запись.ИсходныйСтатус = Изменение["fromString"];
					Запись.КонечныйСтатус = Изменение["toString"];
				КонецЦикла;
			КонецЦикла;
			
			ДатаСоздания = ВзаимодействиеC_JIRA_КлиентСервер.ПреобразоватьВДату(Задача["fields"]["created"]);
			
			ТЗ = Набор.Выгрузить();
			ТЗ.Сортировать("ДатаСобытия");
			Для а = 0 По ТЗ.Количество()-1 Цикл
				Если а = 0 Тогда // Первая запись
					ТЗ[а].МинутПробылВИсходномСтатусе = (ТЗ[а].ДатаСобытия - ДатаСоздания) / 60;
				Иначе 
					ТЗ[а].МинутПробылВИсходномСтатусе = (ТЗ[а].ДатаСобытия - ТЗ[а-1].ДатаСобытия) / 60;	
				КонецЕсли;
			КонецЦикла;
			
			Набор.Загрузить(ТЗ);
			Набор.Записать(Истина);
		КонецЦикла;
	КонецПроцедуры
	
#КонецЕсли
